## -*- coding: utf-8 -*-

# Скрипт для сбора сырых данных о чекинах vk

import vkontakte
 
# Сколько чекинов нужно для каждой точки
SELECT_COUNT = 200

userId = 305329040
appId = "6179799"
secureKey = "w8vcGPsBRLAZmOr2bTEM"
accessToken = "dc111ea32def9c36072aed702a274d0d4443495ff11988965cdec8a0910abde52a0789cb89e9680970bf5"

vk = vkontakte.API(appId, secureKey, accessToken)

# Собираем чекины из Москвы за последние 24 часа. 
# Для этого разбиваем карту Москвы на участки.
# Смотри https://habrahabr.ru/company/meanwhile/blog/206206/
points = [
        [55.91843, 37.379394],
        [55.908424, 37.541442],
        [55.895336, 37.682891],
        [55.822116, 37.821593],
        [55.742574, 37.839446],
        [55.658996, 37.836699],
        [55.579897, 37.687011],
        [55.583002, 37.551055],
        [55.646599, 37.387633],
        [55.72943, 37.38214],
        [55.829059, 37.399993],
        [55.827516, 37.541442],
        [55.816715, 37.680144],
        [55.730977, 37.680144],
        [55.66132, 37.677398],
        [55.66132, 37.537322],
        [55.740255, 37.535949],
        [55.754071, 37.617504],
        [55.989164, 37.184386],
        [55.519302, 37.520843],
]

# Все чекины, привязанные к местам
placesCheckins = []

i = 0
while i < 1:
    loadedCheckins = vk.places.getCheckins(latitude = 55.91843,
                                    longitude = 37.379394)
    print loadedCheckins
    i += 1